/* automatically generated by rust-bindgen 0.70.1 */

pub const _GLIBCXX_CSTDDEF: u32 = 1;
pub const _GLIBCXX_CXX_CONFIG_H: u32 = 1;
pub const _GLIBCXX_RELEASE: u32 = 12;
pub const __GLIBCXX__: u32 = 20230510;
pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: u32 = 1;
pub const _GLIBCXX_USE_DEPRECATED: u32 = 1;
pub const _GLIBCXX_EXTERN_TEMPLATE: u32 = 1;
pub const _GLIBCXX_USE_DUAL_ABI: u32 = 1;
pub const _GLIBCXX_USE_CXX11_ABI: u32 = 1;
pub const _GLIBCXX_INLINE_VERSION: u32 = 0;
pub const _GLIBCXX_HAVE_IS_CONSTANT_EVALUATED: u32 = 1;
pub const _GLIBCXX_VERBOSE_ASSERT: u32 = 1;
pub const _GLIBCXX_USE_ALLOCATOR_NEW: u32 = 1;
pub const _GLIBCXX_OS_DEFINES: u32 = 1;
pub const __NO_CTYPE: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _ISOC2X_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const _DYNAMIC_STACK_SIZE_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;

pub const BUFSIZ: u32 = 8192;
pub const EOF: i32 = -1;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const SEEK_DATA: u32 = 3;
pub const SEEK_HOLE: u32 = 4;
pub const P_tmpdir: &[u8; 5] = b"/tmp\0";
pub const _BITS_STDIO_LIM_H: u32 = 1;
pub const L_tmpnam: u32 = 20;
pub const TMP_MAX: u32 = 238328;
pub const FILENAME_MAX: u32 = 4096;
pub const L_ctermid: u32 = 9;
pub const L_cuserid: u32 = 9;
pub const FOPEN_MAX: u32 = 16;
pub const _PRINTF_NAN_LEN_MAX: u32 = 4;
pub const RENAME_NOREPLACE: u32 = 1;
pub const RENAME_EXCHANGE: u32 = 2;
pub const RENAME_WHITEOUT: u32 = 4;
pub const _GLIBCXX_CSTDIO: u32 = 1;
pub const _GLIBCXX_STDLIB_H: u32 = 1;
pub const OBJECTS: u32 = 1;
pub const BASE_ANIMALS: u32 = 40;
pub const BASE_PLANTS: u32 = 10;
pub const BIOMES: u32 = 3;
pub const CHUNK_SIZE: u32 = 17;
pub const WORLD_SIZE: u32 = 256;
pub const WORLD_CENTER: u32 = 128;
pub const WORLD_SCALE: f64 = 100.0;
pub type PacketType = ::std::os::raw::c_uchar;
pub const PACKET_UNKNOWN: PacketType = 0;
pub const PACKET_PLAYER_UPDATE: PacketType = 1;
pub const PACKET_PLAYER_ID: PacketType = 2;
pub const PACKET_PLAYER_MOVE: PacketType = 3;
pub const PACKET_CHUNK_UPDATE: PacketType = 4;
pub const PACKET_JOIN_REQUEST: PacketType = 5;
pub const PACKET_OBJECT_UPDATE: PacketType = 6;
pub const PACKET_PLAYER_ACTION_PICKUP: PacketType = 7;
pub const PACKET_PLAYER_ACTION_DROP: PacketType = 8;
pub const PACKET_PLAYER_ACTION_USE_ITEM_ON_OBJECT: PacketType = 9;
pub const PACKET_PLAYER_ACTION_CRAFT: PacketType = 10;
pub const PACKET_LOCATION_UPDATE: PacketType = 11;
pub const PACKET_OBJECT_CREATE: PacketType = 12;
pub const PACKET_OBJECT_DESTROY: PacketType = 13;
pub const PACKET_FAILED_CRAFT: PacketType = 14;
pub const PACKET_PLAYER_ACTION_USE_ITEM_ON_TILE: PacketType = 15;
pub const PACKET_REQUEST_CHUNK: PacketType = 16;
pub const PACKET_KEEP_ALIVE: PacketType = 17;
pub const PACKET_PLAYER_ACTION_ON_OBJECT: PacketType = 18;
pub const PACKET_SERVER_ACTION_ON_OBJECT: PacketType = 19;
pub const PACKET_ACTION_FAILED: PacketType = 20;
pub const PACKET_KNOWLEDGE_UPDATE: PacketType = 21;
pub const PACKET_CHECKED_UPDATE: PacketType = 22;
pub const PACKET_ELEMENTS_LIST: PacketType = 23;
pub const PACKET_REQUEST_ITEM: PacketType = 24;
pub const PACKET_COUNT: PacketType = 25;
extern "C" {
    pub static mut packet_type_names: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_Z21show_packet_type_namech"]
    pub fn show_packet_type_name(what: ::std::os::raw::c_char, i: ::std::os::raw::c_uchar);
}
extern "C" {
    pub static mut trace_network: ::std::os::raw::c_int;
}
pub type std_nullptr_t = *const ::std::os::raw::c_void;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub const Class_id_Class_Unknown: Class_id = 0;
pub const Class_id_Class_BaseElement: Class_id = 1;
pub const Class_id_Class_BaseAnimal: Class_id = 2;
pub const Class_id_Class_BasePlant: Class_id = 3;
pub const Class_id_Class_Element: Class_id = 4;
pub const Class_id_Class_Ingredient: Class_id = 5;
pub const Class_id_Class_Product: Class_id = 6;
pub const Class_id_Class_Scroll: Class_id = 7;
pub const Class_id_Class_Plant: Class_id = 8;
pub const Class_id_Class_Animal: Class_id = 9;
pub const Class_id_Class_Player: Class_id = 10;
pub const Class_id_Class_Npc: Class_id = 11;
pub const Class_id_Class_Clan: Class_id = 12;
pub type Class_id = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, serde :: Deserialize, PartialEq, Eq)]
pub struct NetworkObject {
    pub c_id: Class_id,
    pub uid: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NetworkObject"][::std::mem::size_of::<NetworkObject>() - 16usize];
    ["Alignment of NetworkObject"][::std::mem::align_of::<NetworkObject>() - 8usize];
    ["Offset of field: NetworkObject::c_id"][::std::mem::offset_of!(NetworkObject, c_id) - 0usize];
    ["Offset of field: NetworkObject::uid"][::std::mem::offset_of!(NetworkObject, uid) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN13NetworkObjectC1E8Class_id"]
    pub fn NetworkObject_NetworkObject(this: *mut NetworkObject, id: Class_id);
}
extern "C" {
    #[link_name = "\u{1}_ZN13NetworkObjectC1E8Class_idm"]
    pub fn NetworkObject_NetworkObject1(this: *mut NetworkObject, id: Class_id, uid: usize);
}
impl NetworkObject {
    #[inline]
    pub unsafe fn new(id: Class_id) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        NetworkObject_NetworkObject(__bindgen_tmp.as_mut_ptr(), id);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(id: Class_id, uid: usize) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        NetworkObject_NetworkObject1(__bindgen_tmp.as_mut_ptr(), id, uid);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_Z11create_namei"]
    pub fn create_name(s: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtof32(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64x;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strfromd(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfroml(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: u128,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32x,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64x,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strtol_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtod_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtold_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> u128;
}
extern "C" {
    pub fn strtof32_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64x;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::fds_bits"][::std::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp64(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemp64(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize_file_name(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type comparison_fn_t = __compar_fn_t;
pub type __compar_d_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_d_fn_t,
        __arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut u32,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut u32, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const u32, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn posix_openpt(__oflag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn grantpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlockpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ptsname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ptsname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpt() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type fpos_t = __fpos_t;
pub type fpos64_t = __fpos64_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat2(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpfile64() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgets_unlocked(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __s: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fputs_unlocked(
        __s: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseeko64(
        __stream: *mut FILE,
        __off: __off64_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello64(__stream: *mut FILE) -> __off64_t;
}
extern "C" {
    pub fn fgetpos64(__stream: *mut FILE, __pos: *mut fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos64(__stream: *mut FILE, __pos: *const fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cuserid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obstack {
    _unused: [u8; 0],
}
extern "C" {
    pub fn obstack_printf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn obstack_vprintf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        __args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SerializablePointer<T> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
    pub ptr: *mut T,
    pub id: NetworkObject,
}
#[doc = " <div rustbindgen nodebug></div>"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SerializableCString {
    pub str_: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SerializableCString"][::std::mem::size_of::<SerializableCString>() - 8usize];
    ["Alignment of SerializableCString"][::std::mem::align_of::<SerializableCString>() - 8usize];
    ["Offset of field: SerializableCString::str_"]
        [::std::mem::offset_of!(SerializableCString, str_) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN19SerializableCStringC1EPKc"]
    pub fn SerializableCString_SerializableCString(
        this: *mut SerializableCString,
        s: *const ::std::os::raw::c_char,
    );
}
impl SerializableCString {
    #[inline]
    pub unsafe fn new(s: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        SerializableCString_SerializableCString(__bindgen_tmp.as_mut_ptr(), s);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, serde :: Deserialize)]
pub struct Property {
    pub name: SerializableCString,
    pub value: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Property"][::std::mem::size_of::<Property>() - 16usize];
    ["Alignment of Property"][::std::mem::align_of::<Property>() - 8usize];
    ["Offset of field: Property::name"][::std::mem::offset_of!(Property, name) - 0usize];
    ["Offset of field: Property::value"][::std::mem::offset_of!(Property, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct Edible {
    pub irrigation: Property,
    pub poison: Property,
    pub caloric: Property,
    pub eating_by: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Edible"][::std::mem::size_of::<Edible>() - 56usize];
    ["Alignment of Edible"][::std::mem::align_of::<Edible>() - 8usize];
    ["Offset of field: Edible::irrigation"][::std::mem::offset_of!(Edible, irrigation) - 0usize];
    ["Offset of field: Edible::poison"][::std::mem::offset_of!(Edible, poison) - 16usize];
    ["Offset of field: Edible::caloric"][::std::mem::offset_of!(Edible, caloric) - 32usize];
    ["Offset of field: Edible::eating_by"][::std::mem::offset_of!(Edible, eating_by) - 48usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN6Edible4showEv"]
    pub fn Edible_show(this: *mut Edible);
}
extern "C" {
    #[link_name = "\u{1}_ZN6EdibleC1Ev"]
    pub fn Edible_Edible(this: *mut Edible);
}
extern "C" {
    #[link_name = "\u{1}_ZN6EdibleD1Ev"]
    pub fn Edible_Edible_destructor(this: *mut Edible);
}
impl Edible {
    #[inline]
    pub unsafe fn show(&mut self) {
        Edible_show(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Edible_Edible(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        Edible_Edible_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, serde :: Deserialize, Clone, Copy)]
pub struct Solid {
    pub tooling: Property,
    pub stretching: Property,
    pub squeezing: Property,
    pub bending: Property,
    pub solubility: Property,
    pub hardness: Property,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Solid"][::std::mem::size_of::<Solid>() - 96usize];
    ["Alignment of Solid"][::std::mem::align_of::<Solid>() - 8usize];
    ["Offset of field: Solid::tooling"][::std::mem::offset_of!(Solid, tooling) - 0usize];
    ["Offset of field: Solid::stretching"][::std::mem::offset_of!(Solid, stretching) - 16usize];
    ["Offset of field: Solid::squeezing"][::std::mem::offset_of!(Solid, squeezing) - 32usize];
    ["Offset of field: Solid::bending"][::std::mem::offset_of!(Solid, bending) - 48usize];
    ["Offset of field: Solid::solubility"][::std::mem::offset_of!(Solid, solubility) - 64usize];
    ["Offset of field: Solid::hardness"][::std::mem::offset_of!(Solid, hardness) - 80usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN5Solid4showEv"]
    pub fn Solid_show(this: *mut Solid);
}
extern "C" {
    #[link_name = "\u{1}_ZN5SolidC1Ev"]
    pub fn Solid_Solid(this: *mut Solid);
}
extern "C" {
    #[link_name = "\u{1}_ZN5SolidD1Ev"]
    pub fn Solid_Solid_destructor(this: *mut Solid);
}
impl Solid {
    #[inline]
    pub unsafe fn show(&mut self) {
        Solid_show(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Solid_Solid(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        Solid_Solid_destructor(self)
    }
}
pub const Form_Form_unknown: Form = 0;
pub const Form_Form_solid: Form = 1;
pub const Form_Form_liquid: Form = 2;
pub const Form_Form_gas: Form = 3;
pub type Form = ::std::os::raw::c_uint;
extern "C" {
    pub static mut Form_name: [*const ::std::os::raw::c_char; 0usize];
}
pub const ItemLocation_Tag_Chunk: ItemLocation_Tag = 0;
pub const ItemLocation_Tag_Player: ItemLocation_Tag = 1;
pub type ItemLocation_Tag = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ItemLocation_Chunk_Body {
    pub map_x: i32,
    pub map_y: i32,
    pub x: i32,
    pub y: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ItemLocation_Chunk_Body"][::std::mem::size_of::<ItemLocation_Chunk_Body>() - 16usize];
    ["Alignment of ItemLocation_Chunk_Body"]
        [::std::mem::align_of::<ItemLocation_Chunk_Body>() - 4usize];
    ["Offset of field: ItemLocation_Chunk_Body::map_x"]
        [::std::mem::offset_of!(ItemLocation_Chunk_Body, map_x) - 0usize];
    ["Offset of field: ItemLocation_Chunk_Body::map_y"]
        [::std::mem::offset_of!(ItemLocation_Chunk_Body, map_y) - 4usize];
    ["Offset of field: ItemLocation_Chunk_Body::x"]
        [::std::mem::offset_of!(ItemLocation_Chunk_Body, x) - 8usize];
    ["Offset of field: ItemLocation_Chunk_Body::y"]
        [::std::mem::offset_of!(ItemLocation_Chunk_Body, y) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ItemLocation_Player_Body {
    pub id: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ItemLocation_Player_Body"]
        [::std::mem::size_of::<ItemLocation_Player_Body>() - 8usize];
    ["Alignment of ItemLocation_Player_Body"]
        [::std::mem::align_of::<ItemLocation_Player_Body>() - 8usize];
    ["Offset of field: ItemLocation_Player_Body::id"]
        [::std::mem::offset_of!(ItemLocation_Player_Body, id) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ItemLocation__bindgen_ty_1 {
    pub chunk: ItemLocation_Chunk_Body,
    pub player: ItemLocation_Player_Body,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ItemLocation__bindgen_ty_1"]
        [::std::mem::size_of::<ItemLocation__bindgen_ty_1>() - 16usize];
    ["Alignment of ItemLocation__bindgen_ty_1"]
        [::std::mem::align_of::<ItemLocation__bindgen_ty_1>() - 8usize];
    ["Offset of field: ItemLocation__bindgen_ty_1::chunk"]
        [::std::mem::offset_of!(ItemLocation__bindgen_ty_1, chunk) - 0usize];
    ["Offset of field: ItemLocation__bindgen_ty_1::player"]
        [::std::mem::offset_of!(ItemLocation__bindgen_ty_1, player) - 0usize];
};
extern "C" {
    pub static mut class_name: [*const ::std::os::raw::c_char; 0usize];
}
pub const Product_action_ACT_NOTHING: Product_action = 0;
pub const Product_action_ACT_CUT: Product_action = 1;
pub const Product_action_ACT_HIT: Product_action = 2;
pub const Product_action_ACT_STAB: Product_action = 3;
pub const Product_action_ACT_FIRE: Product_action = 4;
pub type Product_action = ::std::os::raw::c_uint;
extern "C" {
    pub static mut product_action_name: [*const ::std::os::raw::c_char; 0usize];
}
pub const Player_action_PLAYER_DRINK: Player_action = 0;
pub const Player_action_PLAYER_EAT: Player_action = 1;
pub const Player_action_PLAYER_READ: Player_action = 2;
pub const Player_action_PLAYER_CHECK: Player_action = 3;
pub type Player_action = ::std::os::raw::c_uint;
extern "C" {
    pub static mut player_action_name: [*const ::std::os::raw::c_char; 0usize];
}
pub const Server_action_SERVER_SHOW_ITEM: Server_action = 0;
pub const Server_action_SERVER_SHOW_CHUNK: Server_action = 1;
pub const Server_action_SERVER_TRACE_NETWORK: Server_action = 2;
pub type Server_action = ::std::os::raw::c_uint;
extern "C" {
    pub static mut server_action_name: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
pub struct Base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct Base {
    pub vtable_: *const Base__bindgen_vtable,
    pub _base: NetworkObject,
    pub edible: Edible,
    pub name: SerializableCString,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Base"][::std::mem::size_of::<Base>() - 88usize];
    ["Alignment of Base"][::std::mem::align_of::<Base>() - 8usize];
    ["Offset of field: Base::edible"][::std::mem::offset_of!(Base, edible) - 24usize];
    ["Offset of field: Base::name"][::std::mem::offset_of!(Base, name) - 80usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN4Base8get_nameEv"]
    pub fn Base_get_name(this: *mut Base) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN4BaseC1Ei8Class_idPKc"]
    pub fn Base_Base(
        this: *mut Base,
        index: ::std::os::raw::c_int,
        c: Class_id,
        name: *const ::std::os::raw::c_char,
    );
}
impl Base {
    #[inline]
    pub unsafe fn get_name(&mut self) -> *const ::std::os::raw::c_char {
        Base_get_name(self)
    }
    #[inline]
    pub unsafe fn new(
        index: ::std::os::raw::c_int,
        c: Class_id,
        name: *const ::std::os::raw::c_char,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Base_Base(__bindgen_tmp.as_mut_ptr(), index, c, name);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN4Base4showEb"]
    pub fn Base_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone, serde :: Deserialize)]
pub struct Color {
    pub r: ::std::os::raw::c_int,
    pub g: ::std::os::raw::c_int,
    pub b: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Color"][::std::mem::size_of::<Color>() - 12usize];
    ["Alignment of Color"][::std::mem::align_of::<Color>() - 4usize];
    ["Offset of field: Color::r"][::std::mem::offset_of!(Color, r) - 0usize];
    ["Offset of field: Color::g"][::std::mem::offset_of!(Color, g) - 4usize];
    ["Offset of field: Color::b"][::std::mem::offset_of!(Color, b) - 8usize];
};
#[repr(C)]
#[derive(Debug, serde :: Deserialize, Clone, Copy)]
pub struct BaseElement {
    pub _base: Base,
    pub form: Form,
    pub color: Color,
    pub density: Property,
    pub solid: Solid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BaseElement"][::std::mem::size_of::<BaseElement>() - 216usize];
    ["Alignment of BaseElement"][::std::mem::align_of::<BaseElement>() - 8usize];
    ["Offset of field: BaseElement::form"][::std::mem::offset_of!(BaseElement, form) - 88usize];
    ["Offset of field: BaseElement::color"][::std::mem::offset_of!(BaseElement, color) - 92usize];
    ["Offset of field: BaseElement::density"]
        [::std::mem::offset_of!(BaseElement, density) - 104usize];
    ["Offset of field: BaseElement::solid"][::std::mem::offset_of!(BaseElement, solid) - 120usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN11BaseElementC1E4Formi"]
    pub fn BaseElement_BaseElement(this: *mut BaseElement, f: Form, index: ::std::os::raw::c_int);
}
impl BaseElement {
    #[inline]
    pub unsafe fn new(f: Form, index: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        BaseElement_BaseElement(__bindgen_tmp.as_mut_ptr(), f, index);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN11BaseElement4showEb"]
    pub fn BaseElement_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
pub struct InventoryElement__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct InventoryElement {
    pub vtable_: *const InventoryElement__bindgen_vtable,
    pub _base: NetworkObject,
    pub location: ItemLocation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InventoryElement"][::std::mem::size_of::<InventoryElement>() - 48usize];
    ["Alignment of InventoryElement"][::std::mem::align_of::<InventoryElement>() - 8usize];
    ["Offset of field: InventoryElement::location"]
        [::std::mem::offset_of!(InventoryElement, location) - 24usize];
};
extern "C" {
    #[link_name = "\u{1}_ZNK16InventoryElement7get_cidEv"]
    pub fn InventoryElement_get_cid(this: *const InventoryElement) -> Class_id;
}
extern "C" {
    #[link_name = "\u{1}_ZNK16InventoryElement7get_uidEv"]
    pub fn InventoryElement_get_uid(this: *const InventoryElement) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZN16InventoryElementC1E8Class_idm12ItemLocation"]
    pub fn InventoryElement_InventoryElement(
        this: *mut InventoryElement,
        c_id: Class_id,
        uid: usize,
        location: ItemLocation,
    );
}
impl InventoryElement {
    #[inline]
    pub unsafe fn get_cid(&self) -> Class_id {
        InventoryElement_get_cid(self)
    }
    #[inline]
    pub unsafe fn get_uid(&self) -> usize {
        InventoryElement_get_uid(self)
    }
    #[inline]
    pub unsafe fn new(c_id: Class_id, uid: usize, location: ItemLocation) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        InventoryElement_InventoryElement(__bindgen_tmp.as_mut_ptr(), c_id, uid, location);
        __bindgen_tmp.assume_init()
    }
}
pub const object_types_OBJECT_wall: object_types = 0;
pub type object_types = ::std::os::raw::c_uint;
extern "C" {
    pub static mut object_names: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
pub struct Object {
    pub _base: InventoryElement,
    pub base: *mut BaseElement,
    pub type_: object_types,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Object"][::std::mem::size_of::<Object>() - 64usize];
    ["Alignment of Object"][::std::mem::align_of::<Object>() - 8usize];
    ["Offset of field: Object::base"][::std::mem::offset_of!(Object, base) - 48usize];
    ["Offset of field: Object::type_"][::std::mem::offset_of!(Object, type_) - 56usize];
};
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Scroll {
    pub _base: InventoryElement,
    pub base: SerializablePointer<Base>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Scroll"][::std::mem::size_of::<Scroll>() - 72usize];
    ["Alignment of Scroll"][::std::mem::align_of::<Scroll>() - 8usize];
    ["Offset of field: Scroll::base"][::std::mem::offset_of!(Scroll, base) - 48usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN6ScrollC1EP4Base"]
    pub fn Scroll_Scroll(this: *mut Scroll, b: *mut Base);
}
impl Scroll {
    #[inline]
    pub unsafe fn new(b: *mut Base) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Scroll_Scroll(__bindgen_tmp.as_mut_ptr(), b);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Element {
    pub _base: InventoryElement,
    pub base: SerializablePointer<BaseElement>,
    pub length: Property,
    pub width: Property,
    pub height: Property,
    pub volume: Property,
    pub sharpness: Property,
    pub smoothness: Property,
    pub mass: Property,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Element"][::std::mem::size_of::<Element>() - 184usize];
    ["Alignment of Element"][::std::mem::align_of::<Element>() - 8usize];
    ["Offset of field: Element::base"][::std::mem::offset_of!(Element, base) - 48usize];
    ["Offset of field: Element::length"][::std::mem::offset_of!(Element, length) - 72usize];
    ["Offset of field: Element::width"][::std::mem::offset_of!(Element, width) - 88usize];
    ["Offset of field: Element::height"][::std::mem::offset_of!(Element, height) - 104usize];
    ["Offset of field: Element::volume"][::std::mem::offset_of!(Element, volume) - 120usize];
    ["Offset of field: Element::sharpness"][::std::mem::offset_of!(Element, sharpness) - 136usize];
    ["Offset of field: Element::smoothness"]
        [::std::mem::offset_of!(Element, smoothness) - 152usize];
    ["Offset of field: Element::mass"][::std::mem::offset_of!(Element, mass) - 168usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN7ElementC1EP11BaseElement"]
    pub fn Element_Element(this: *mut Element, b: *mut BaseElement);
}
impl Element {
    #[inline]
    pub unsafe fn new(b: *mut BaseElement) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Element_Element(__bindgen_tmp.as_mut_ptr(), b);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7Element4showEb"]
    pub fn Element_show(this: *mut ::std::os::raw::c_void, details: bool);
}
pub const Ingredient_id_ING_AXE_BLADE: Ingredient_id = 0;
pub const Ingredient_id_ING_AXE_HANDLE: Ingredient_id = 1;
pub const Ingredient_id_ING_KNIFE_BLADE: Ingredient_id = 2;
pub const Ingredient_id_ING_KNIFE_HANDLE: Ingredient_id = 3;
pub const Ingredient_id_ING_PICKAXE_BLADE: Ingredient_id = 4;
pub const Ingredient_id_ING_PICKAXE_HANDLE: Ingredient_id = 5;
pub const Ingredient_id_ING_WALL: Ingredient_id = 6;
pub const Ingredient_id_ING_MEAT: Ingredient_id = 7;
pub const Ingredient_id_ING_LOG: Ingredient_id = 8;
pub const Ingredient_id_ING_TINDER: Ingredient_id = 9;
pub const Ingredient_id_ING_STICK: Ingredient_id = 10;
pub const Ingredient_id_ING_FRUIT: Ingredient_id = 11;
pub const Ingredient_id_ING_COUNT: Ingredient_id = 12;
pub type Ingredient_id = ::std::os::raw::c_uint;
pub const Product_id_PROD_AXE: Product_id = 0;
pub const Product_id_PROD_KNIFE: Product_id = 1;
pub const Product_id_PROD_PICKAXE: Product_id = 2;
pub const Product_id_PROD_HUT: Product_id = 3;
pub const Product_id_PROD_FIRE: Product_id = 4;
pub const Product_id_PROD_ROASTED_MEAT: Product_id = 5;
pub const Product_id_PROD_FRUIT_SALAD: Product_id = 6;
pub const Product_id_PROD_COUNT: Product_id = 7;
pub type Product_id = ::std::os::raw::c_uint;
extern "C" {
    pub static mut ingredient_name: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut product_name: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Ingredient {
    pub _base: InventoryElement,
    pub padding: usize,
    pub quality: Property,
    pub resilience: Property,
    pub usage: Property,
    pub id: Ingredient_id,
    pub req_form: Form,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Ingredient"][::std::mem::size_of::<Ingredient>() - 112usize];
    ["Alignment of Ingredient"][::std::mem::align_of::<Ingredient>() - 8usize];
    ["Offset of field: Ingredient::padding"][::std::mem::offset_of!(Ingredient, padding) - 48usize];
    ["Offset of field: Ingredient::quality"][::std::mem::offset_of!(Ingredient, quality) - 56usize];
    ["Offset of field: Ingredient::resilience"]
        [::std::mem::offset_of!(Ingredient, resilience) - 72usize];
    ["Offset of field: Ingredient::usage"][::std::mem::offset_of!(Ingredient, usage) - 88usize];
    ["Offset of field: Ingredient::id"][::std::mem::offset_of!(Ingredient, id) - 104usize];
    ["Offset of field: Ingredient::req_form"]
        [::std::mem::offset_of!(Ingredient, req_form) - 108usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN10IngredientC1E13Ingredient_id"]
    pub fn Ingredient_Ingredient(this: *mut Ingredient, i: Ingredient_id);
}
impl Ingredient {
    #[inline]
    pub unsafe fn new(i: Ingredient_id) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Ingredient_Ingredient(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN10Ingredient4showEb"]
    pub fn Ingredient_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Product {
    pub _base: InventoryElement,
    pub padding: usize,
    pub quality: Property,
    pub resilience: Property,
    pub usage: Property,
    pub req_form: Form,
    pub actions: Product_action,
    pub actions_count: ::std::os::raw::c_int,
    pub id: Product_id,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Product"][::std::mem::size_of::<Product>() - 120usize];
    ["Alignment of Product"][::std::mem::align_of::<Product>() - 8usize];
    ["Offset of field: Product::padding"][::std::mem::offset_of!(Product, padding) - 48usize];
    ["Offset of field: Product::quality"][::std::mem::offset_of!(Product, quality) - 56usize];
    ["Offset of field: Product::resilience"][::std::mem::offset_of!(Product, resilience) - 72usize];
    ["Offset of field: Product::usage"][::std::mem::offset_of!(Product, usage) - 88usize];
    ["Offset of field: Product::req_form"][::std::mem::offset_of!(Product, req_form) - 104usize];
    ["Offset of field: Product::actions"][::std::mem::offset_of!(Product, actions) - 108usize];
    ["Offset of field: Product::actions_count"]
        [::std::mem::offset_of!(Product, actions_count) - 112usize];
    ["Offset of field: Product::id"][::std::mem::offset_of!(Product, id) - 116usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN7ProductC1E10Product_id"]
    pub fn Product_Product(this: *mut Product, i: Product_id);
}
impl Product {
    #[inline]
    pub unsafe fn new(i: Product_id) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Product_Product(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7Product4showEb"]
    pub fn Product_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
#[derive(Debug, serde :: Deserialize, Clone, Copy)]
pub struct BaseAnimal {
    pub _base: Base,
    pub carnivorous: bool,
    pub swimming: bool,
    pub flying: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BaseAnimal"][::std::mem::size_of::<BaseAnimal>() - 96usize];
    ["Alignment of BaseAnimal"][::std::mem::align_of::<BaseAnimal>() - 8usize];
    ["Offset of field: BaseAnimal::carnivorous"]
        [::std::mem::offset_of!(BaseAnimal, carnivorous) - 88usize];
    ["Offset of field: BaseAnimal::swimming"]
        [::std::mem::offset_of!(BaseAnimal, swimming) - 89usize];
    ["Offset of field: BaseAnimal::flying"][::std::mem::offset_of!(BaseAnimal, flying) - 90usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN10BaseAnimalC1Ei"]
    pub fn BaseAnimal_BaseAnimal(this: *mut BaseAnimal, index: ::std::os::raw::c_int);
}
impl BaseAnimal {
    #[inline]
    pub unsafe fn new(index: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        BaseAnimal_BaseAnimal(__bindgen_tmp.as_mut_ptr(), index);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Animal {
    pub _base: InventoryElement,
    pub base: SerializablePointer<BaseAnimal>,
    pub size: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Animal"][::std::mem::size_of::<Animal>() - 80usize];
    ["Alignment of Animal"][::std::mem::align_of::<Animal>() - 8usize];
    ["Offset of field: Animal::base"][::std::mem::offset_of!(Animal, base) - 48usize];
    ["Offset of field: Animal::size"][::std::mem::offset_of!(Animal, size) - 72usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN6AnimalC1EP10BaseAnimal"]
    pub fn Animal_Animal(this: *mut Animal, b: *mut BaseAnimal);
}
impl Animal {
    #[inline]
    pub unsafe fn new(b: *mut BaseAnimal) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Animal_Animal(__bindgen_tmp.as_mut_ptr(), b);
        __bindgen_tmp.assume_init()
    }
}
pub const Plant_phase_Plant_seed: Plant_phase = 0;
pub const Plant_phase_Plant_seedling: Plant_phase = 1;
pub const Plant_phase_Plant_growing: Plant_phase = 2;
pub const Plant_phase_Plant_flowers: Plant_phase = 3;
pub const Plant_phase_Plant_fruits: Plant_phase = 4;
pub type Plant_phase = ::std::os::raw::c_uint;
extern "C" {
    pub static mut plant_phase_name: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(Debug, serde :: Deserialize, Clone, Copy)]
pub struct BasePlant {
    pub _base: Base,
    pub flowers: bool,
    pub leaves: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BasePlant"][::std::mem::size_of::<BasePlant>() - 96usize];
    ["Alignment of BasePlant"][::std::mem::align_of::<BasePlant>() - 8usize];
    ["Offset of field: BasePlant::flowers"][::std::mem::offset_of!(BasePlant, flowers) - 88usize];
    ["Offset of field: BasePlant::leaves"][::std::mem::offset_of!(BasePlant, leaves) - 89usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN9BasePlantC1Ei"]
    pub fn BasePlant_BasePlant(this: *mut BasePlant, index: ::std::os::raw::c_int);
}
impl BasePlant {
    #[inline]
    pub unsafe fn new(index: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        BasePlant_BasePlant(__bindgen_tmp.as_mut_ptr(), index);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Plant {
    pub _base: InventoryElement,
    pub base: SerializablePointer<BasePlant>,
    pub seedling_time: ::std::os::raw::c_uint,
    pub growing_time: ::std::os::raw::c_uint,
    pub flowers_time: ::std::os::raw::c_uint,
    pub size: f32,
    pub planted: bool,
    pub water: ::std::os::raw::c_int,
    pub phase: Plant_phase,
    pub grown: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Plant"][::std::mem::size_of::<Plant>() - 104usize];
    ["Alignment of Plant"][::std::mem::align_of::<Plant>() - 8usize];
    ["Offset of field: Plant::base"][::std::mem::offset_of!(Plant, base) - 48usize];
    ["Offset of field: Plant::seedling_time"]
        [::std::mem::offset_of!(Plant, seedling_time) - 72usize];
    ["Offset of field: Plant::growing_time"][::std::mem::offset_of!(Plant, growing_time) - 76usize];
    ["Offset of field: Plant::flowers_time"][::std::mem::offset_of!(Plant, flowers_time) - 80usize];
    ["Offset of field: Plant::size"][::std::mem::offset_of!(Plant, size) - 84usize];
    ["Offset of field: Plant::planted"][::std::mem::offset_of!(Plant, planted) - 88usize];
    ["Offset of field: Plant::water"][::std::mem::offset_of!(Plant, water) - 92usize];
    ["Offset of field: Plant::phase"][::std::mem::offset_of!(Plant, phase) - 96usize];
    ["Offset of field: Plant::grown"][::std::mem::offset_of!(Plant, grown) - 100usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN5PlantC1EP9BasePlant"]
    pub fn Plant_Plant(this: *mut Plant, b: *mut BasePlant);
}
impl Plant {
    #[inline]
    pub unsafe fn new(b: *mut BasePlant) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Plant_Plant(__bindgen_tmp.as_mut_ptr(), b);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct ListElement__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct ListElement {
    pub vtable_: *const ListElement__bindgen_vtable,
    pub enabled: bool,
    pub el: SerializablePointer<NetworkObject>,
    pub next: *mut ListElement,
    pub prev: *mut ListElement,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ListElement"][::std::mem::size_of::<ListElement>() - 56usize];
    ["Alignment of ListElement"][::std::mem::align_of::<ListElement>() - 8usize];
    ["Offset of field: ListElement::enabled"]
        [::std::mem::offset_of!(ListElement, enabled) - 8usize];
    ["Offset of field: ListElement::el"][::std::mem::offset_of!(ListElement, el) - 16usize];
    ["Offset of field: ListElement::next"][::std::mem::offset_of!(ListElement, next) - 40usize];
    ["Offset of field: ListElement::prev"][::std::mem::offset_of!(ListElement, prev) - 48usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN11ListElement3addEPS_"]
    pub fn ListElement_add(this: *mut ListElement, entry: *mut ListElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN11ListElementC1EP16InventoryElement"]
    pub fn ListElement_ListElement(this: *mut ListElement, entry: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN11ListElementC1EP13NetworkObject"]
    pub fn ListElement_ListElement1(this: *mut ListElement, entry: *mut NetworkObject);
}
impl ListElement {
    #[inline]
    pub unsafe fn add(&mut self, entry: *mut ListElement) {
        ListElement_add(self, entry)
    }
    #[inline]
    pub unsafe fn new(entry: *mut InventoryElement) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        ListElement_ListElement(__bindgen_tmp.as_mut_ptr(), entry);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(entry: *mut NetworkObject) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        ListElement_ListElement1(__bindgen_tmp.as_mut_ptr(), entry);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN11ListElement4showEb"]
    pub fn ListElement_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ElId {
    pub c_id: Class_id,
    pub id: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ElId"][::std::mem::size_of::<ElId>() - 8usize];
    ["Alignment of ElId"][::std::mem::align_of::<ElId>() - 4usize];
    ["Offset of field: ElId::c_id"][::std::mem::offset_of!(ElId, c_id) - 0usize];
    ["Offset of field: ElId::id"][::std::mem::offset_of!(ElId, id) - 4usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct KnownElement {
    pub _base: ListElement,
    pub elid: ElId,
    pub known: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KnownElement"][::std::mem::size_of::<KnownElement>() - 72usize];
    ["Alignment of KnownElement"][::std::mem::align_of::<KnownElement>() - 8usize];
    ["Offset of field: KnownElement::elid"][::std::mem::offset_of!(KnownElement, elid) - 56usize];
    ["Offset of field: KnownElement::known"][::std::mem::offset_of!(KnownElement, known) - 64usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct BaseListElement {
    pub _base: ListElement,
    pub base: *mut Base,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BaseListElement"][::std::mem::size_of::<BaseListElement>() - 64usize];
    ["Alignment of BaseListElement"][::std::mem::align_of::<BaseListElement>() - 8usize];
    ["Offset of field: BaseListElement::base"]
        [::std::mem::offset_of!(BaseListElement, base) - 56usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN15BaseListElement4showEb"]
    pub fn BaseListElement_show(this: *mut ::std::os::raw::c_void, details: bool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ElementsListIterator {
    pub le: *mut ListElement,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ElementsListIterator"][::std::mem::size_of::<ElementsListIterator>() - 8usize];
    ["Alignment of ElementsListIterator"][::std::mem::align_of::<ElementsListIterator>() - 8usize];
    ["Offset of field: ElementsListIterator::le"]
        [::std::mem::offset_of!(ElementsListIterator, le) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN20ElementsListIterator4nextEv"]
    pub fn ElementsListIterator_next(this: *mut ElementsListIterator) -> ElementsListIterator;
}
extern "C" {
    #[link_name = "\u{1}_ZN20ElementsListIterator5equalERKS_"]
    pub fn ElementsListIterator_equal(
        this: *mut ElementsListIterator,
        other: *const ElementsListIterator,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN20ElementsListIterator3getEv"]
    pub fn ElementsListIterator_get(this: *mut ElementsListIterator) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN20ElementsListIteratorC1EP11ListElement"]
    pub fn ElementsListIterator_ElementsListIterator(
        this: *mut ElementsListIterator,
        le: *mut ListElement,
    );
}
impl ElementsListIterator {
    #[inline]
    pub unsafe fn next(&mut self) -> ElementsListIterator {
        ElementsListIterator_next(self)
    }
    #[inline]
    pub unsafe fn equal(&mut self, other: *const ElementsListIterator) -> bool {
        ElementsListIterator_equal(self, other)
    }
    #[inline]
    pub unsafe fn get(&mut self) -> *mut InventoryElement {
        ElementsListIterator_get(self)
    }
    #[inline]
    pub unsafe fn new(le: *mut ListElement) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        ElementsListIterator_ElementsListIterator(__bindgen_tmp.as_mut_ptr(), le);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct ElementsList__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Clone, Copy)]
pub struct ElementsList {
    pub vtable_: *const ElementsList__bindgen_vtable,
    pub name: *const ::std::os::raw::c_char,
    pub nr_elements: ::std::os::raw::c_int,
    pub head: *mut ListElement,
    pub tail: *mut ListElement,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ElementsList"][::std::mem::size_of::<ElementsList>() - 40usize];
    ["Alignment of ElementsList"][::std::mem::align_of::<ElementsList>() - 8usize];
    ["Offset of field: ElementsList::name"][::std::mem::offset_of!(ElementsList, name) - 8usize];
    ["Offset of field: ElementsList::nr_elements"]
        [::std::mem::offset_of!(ElementsList, nr_elements) - 16usize];
    ["Offset of field: ElementsList::head"][::std::mem::offset_of!(ElementsList, head) - 24usize];
    ["Offset of field: ElementsList::tail"][::std::mem::offset_of!(ElementsList, tail) - 32usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList10remove_allEv"]
    pub fn ElementsList_remove_all(this: *mut ElementsList);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList4findEPv"]
    pub fn ElementsList_find(
        this: *mut ElementsList,
        what: *mut ::std::os::raw::c_void,
    ) -> *mut ListElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList4showEb"]
    pub fn ElementsList_show(this: *mut ElementsList, details: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList10enable_allEv"]
    pub fn ElementsList_enable_all(this: *mut ElementsList);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList11disable_allEv"]
    pub fn ElementsList_disable_all(this: *mut ElementsList);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList3addEP11ListElement"]
    pub fn ElementsList_add(this: *mut ElementsList, el: *mut ListElement) -> *mut ListElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList9add_frontEP11ListElement"]
    pub fn ElementsList_add_front(
        this: *mut ElementsList,
        el: *mut ListElement,
    ) -> *mut ListElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList6removeEP11ListElement"]
    pub fn ElementsList_remove(this: *mut ElementsList, el: *mut ListElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList4tickEv"]
    pub fn ElementsList_tick(this: *mut ElementsList);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList13copy_elementsEPS_"]
    pub fn ElementsList_copy_elements(this: *mut ElementsList, dst: *mut ElementsList);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsList10get_randomEv"]
    pub fn ElementsList_get_random(this: *mut ElementsList) -> *mut ListElement;
}
extern "C" {
    #[link_name = "\u{1}_ZNK12ElementsList5beginEv"]
    pub fn ElementsList_begin(this: *const ElementsList) -> ElementsListIterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK12ElementsList3endEv"]
    pub fn ElementsList_end(this: *const ElementsList) -> ElementsListIterator;
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsListC1EPKc"]
    pub fn ElementsList_ElementsList(this: *mut ElementsList, n: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN12ElementsListC1Ev"]
    pub fn ElementsList_ElementsList1(this: *mut ElementsList);
}
impl ElementsList {
    #[inline]
    pub unsafe fn remove_all(&mut self) {
        ElementsList_remove_all(self)
    }
    #[inline]
    pub unsafe fn find(&mut self, what: *mut ::std::os::raw::c_void) -> *mut ListElement {
        ElementsList_find(self, what)
    }
    #[inline]
    pub unsafe fn show(&mut self, details: bool) {
        ElementsList_show(self, details)
    }
    #[inline]
    pub unsafe fn enable_all(&mut self) {
        ElementsList_enable_all(self)
    }
    #[inline]
    pub unsafe fn disable_all(&mut self) {
        ElementsList_disable_all(self)
    }
    #[inline]
    pub unsafe fn add(&mut self, el: *mut ListElement) -> *mut ListElement {
        ElementsList_add(self, el)
    }
    #[inline]
    pub unsafe fn add_front(&mut self, el: *mut ListElement) -> *mut ListElement {
        ElementsList_add_front(self, el)
    }
    #[inline]
    pub unsafe fn remove(&mut self, el: *mut ListElement) {
        ElementsList_remove(self, el)
    }
    #[inline]
    pub unsafe fn tick(&mut self) {
        ElementsList_tick(self)
    }
    #[inline]
    pub unsafe fn copy_elements(&mut self, dst: *mut ElementsList) {
        ElementsList_copy_elements(self, dst)
    }
    #[inline]
    pub unsafe fn get_random(&mut self) -> *mut ListElement {
        ElementsList_get_random(self)
    }
    #[inline]
    pub unsafe fn begin(&self) -> ElementsListIterator {
        ElementsList_begin(self)
    }
    #[inline]
    pub unsafe fn end(&self) -> ElementsListIterator {
        ElementsList_end(self)
    }
    #[inline]
    pub unsafe fn new(n: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        ElementsList_ElementsList(__bindgen_tmp.as_mut_ptr(), n);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        ElementsList_ElementsList1(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
pub type FindFunc = ::std::option::Option<
    unsafe extern "C" fn(el: *mut InventoryElement, arg: *mut ::std::os::raw::c_void) -> bool,
>;
#[repr(C)]
#[derive(Debug, serde :: Deserialize, Clone, Copy)]
pub struct InvList {
    pub _base: ElementsList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InvList"][::std::mem::size_of::<InvList>() - 40usize];
    ["Alignment of InvList"][::std::mem::align_of::<InvList>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN7InvList9find_formE4FormPi"]
    pub fn InvList_find_form(
        this: *mut InvList,
        f: Form,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN7InvList10find_classE8Class_idPi"]
    pub fn InvList_find_class(
        this: *mut InvList,
        cl: Class_id,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN7InvList7find_idEiPi"]
    pub fn InvList_find_id(
        this: *mut InvList,
        id: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN7InvList3addEP16InventoryElement"]
    pub fn InvList_add(this: *mut InvList, el: *mut InventoryElement) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN7InvList9add_frontEP16InventoryElement"]
    pub fn InvList_add_front(
        this: *mut InvList,
        el: *mut InventoryElement,
    ) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN7InvList6removeEP16InventoryElement"]
    pub fn InvList_remove(this: *mut InvList, el: *mut InventoryElement);
}
impl InvList {
    #[inline]
    pub unsafe fn find_form(
        &mut self,
        f: Form,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement {
        InvList_find_form(self, f, count)
    }
    #[inline]
    pub unsafe fn find_class(
        &mut self,
        cl: Class_id,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement {
        InvList_find_class(self, cl, count)
    }
    #[inline]
    pub unsafe fn find_id(
        &mut self,
        id: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut *mut InventoryElement {
        InvList_find_id(self, id, count)
    }
    #[inline]
    pub unsafe fn add(&mut self, el: *mut InventoryElement) -> *mut InventoryElement {
        InvList_add(self, el)
    }
    #[inline]
    pub unsafe fn add_front(&mut self, el: *mut InventoryElement) -> *mut InventoryElement {
        InvList_add_front(self, el)
    }
    #[inline]
    pub unsafe fn remove(&mut self, el: *mut InventoryElement) {
        InvList_remove(self, el)
    }
}
pub const Npc_say_NPC_Answer_do_you_really_care: Npc_say = 0;
pub const Npc_say_NPC_Answer_why_do_you_ask: Npc_say = 1;
pub const Npc_say_NPC_Answer_whos_asking: Npc_say = 2;
pub const Npc_say_NPC_Answer_dont_you_remember: Npc_say = 3;
pub const Npc_say_NPC_Answer_Im_fine: Npc_say = 4;
pub const Npc_say_NPC_Answer_Im_not_fine: Npc_say = 5;
pub const Npc_say_NPC_Answer_I_know_you: Npc_say = 6;
pub const Npc_say_NPC_Answer_I_know_it: Npc_say = 7;
pub const Npc_say_NPC_Answer_I_dont_know_it: Npc_say = 8;
pub const Npc_say_NPC_Answer_I_dont_know_you: Npc_say = 9;
pub const Npc_say_NPC_Answer_I_dont_know_what_you_asking_for: Npc_say = 10;
pub const Npc_say_NPC_Answer_Im: Npc_say = 11;
pub const Npc_say_NPC_Answer_You_are_in_pime: Npc_say = 12;
pub const Npc_say_NPC_Answer_Nothing: Npc_say = 13;
pub const Npc_say_NPC_Ask_do_we_know_each_other: Npc_say = 14;
pub const Npc_say_NPC_Ask_how_are_you: Npc_say = 15;
pub const Npc_say_NPC_Ask_do_you_know_inv_item: Npc_say = 16;
pub const Npc_say_NPC_Ask_do_you_know_item: Npc_say = 17;
pub const Npc_say_NPC_Ask_who_are_you: Npc_say = 18;
pub const Npc_say_NPC_Ask_where_am_I: Npc_say = 19;
pub const Npc_say_NPC_Say_Nothing: Npc_say = 20;
pub const Npc_say_NPC_Say_Hello: Npc_say = 21;
pub const Npc_say_NPC_Say_Bye: Npc_say = 22;
pub const Npc_say_NPC_Say_See_you_later: Npc_say = 23;
pub const Npc_say_NPC_Say_See_you_next_time: Npc_say = 24;
pub type Npc_say = ::std::os::raw::c_uint;
extern "C" {
    #[link_name = "\u{1}_Z12init_answersv"]
    pub fn init_answers();
}
extern "C" {
    pub static mut answers: *mut SentencesList;
}
extern "C" {
    #[link_name = "\u{1}_Z14init_questionsv"]
    pub fn init_questions();
}
extern "C" {
    pub static mut questions: *mut SentencesList;
}
extern "C" {
    #[link_name = "\u{1}_Z14init_sentencesv"]
    pub fn init_sentences();
}
extern "C" {
    pub static mut sentences: *mut SentencesList;
}
#[repr(C)]
#[derive(Debug)]
pub struct Sentence {
    pub _base: ListElement,
    pub text: *const ::std::os::raw::c_char,
    pub id: Npc_say,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sentence"][::std::mem::size_of::<Sentence>() - 72usize];
    ["Alignment of Sentence"][::std::mem::align_of::<Sentence>() - 8usize];
    ["Offset of field: Sentence::text"][::std::mem::offset_of!(Sentence, text) - 56usize];
    ["Offset of field: Sentence::id"][::std::mem::offset_of!(Sentence, id) - 64usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct SentencesList {
    pub _base: ElementsList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SentencesList"][::std::mem::size_of::<SentencesList>() - 40usize];
    ["Alignment of SentencesList"][::std::mem::align_of::<SentencesList>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN13SentencesList7disableE7Npc_say"]
    pub fn SentencesList_disable(this: *mut SentencesList, id: Npc_say);
}
extern "C" {
    #[link_name = "\u{1}_ZN13SentencesList6enableE7Npc_say"]
    pub fn SentencesList_enable(this: *mut SentencesList, id: Npc_say);
}
impl SentencesList {
    #[inline]
    pub unsafe fn disable(&mut self, id: Npc_say) {
        SentencesList_disable(self, id)
    }
    #[inline]
    pub unsafe fn enable(&mut self, id: Npc_say) {
        SentencesList_enable(self, id)
    }
}
pub const Skill_type_SK_BRAK: Skill_type = 0;
pub const Skill_type_SK_KAMIENIARSTWO: Skill_type = 1;
pub const Skill_type_SK_MAGIA: Skill_type = 2;
pub const Skill_type_SK_RZEMIOSLO: Skill_type = 3;
pub const Skill_type_SK_WALKA: Skill_type = 4;
pub const Skill_type_SK_WEDKARSTWO: Skill_type = 5;
pub const Skill_type_SK_WIAZANIE: Skill_type = 6;
pub const Skill_type_SK_ZIELARSTWO: Skill_type = 7;
pub const Skill_type_SK_HODOWLA: Skill_type = 8;
pub const Skill_type_SK_ZDUNSTWO: Skill_type = 9;
pub const Skill_type_SK_NUM: Skill_type = 10;
pub type Skill_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, serde :: Deserialize)]
pub struct Skill {
    pub experience: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Skill"][::std::mem::size_of::<Skill>() - 4usize];
    ["Alignment of Skill"][::std::mem::align_of::<Skill>() - 4usize];
    ["Offset of field: Skill::experience"][::std::mem::offset_of!(Skill, experience) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN5Skill3useEv"]
    pub fn Skill_use(this: *mut Skill);
}
extern "C" {
    #[link_name = "\u{1}_ZN5SkillC1Ev"]
    pub fn Skill_Skill(this: *mut Skill);
}
impl Skill {
    #[inline]
    pub unsafe fn use_(&mut self) {
        Skill_use(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Skill_Skill(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_Z3gsn10Skill_type"]
    pub fn gsn(t: Skill_type) -> *const ::std::os::raw::c_char;
}
pub const ClanId_Clan_Animal: ClanId = 0;
pub const ClanId_Clan_Human: ClanId = 1;
pub const ClanId_Clan_Dwarf: ClanId = 2;
pub const ClanId_Clan_Elf: ClanId = 3;
pub const ClanId_Clan_Niziolek: ClanId = 4;
pub type ClanId = ::std::os::raw::c_uint;
extern "C" {
    pub static mut clan_names: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Clan {
    pub _base: NetworkObject,
    pub id: ClanId,
    pub skills: [Skill; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Clan"][::std::mem::size_of::<Clan>() - 64usize];
    ["Alignment of Clan"][::std::mem::align_of::<Clan>() - 8usize];
    ["Offset of field: Clan::id"][::std::mem::offset_of!(Clan, id) - 16usize];
    ["Offset of field: Clan::skills"][::std::mem::offset_of!(Clan, skills) - 20usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN4ClanC1E6ClanId"]
    pub fn Clan_Clan(this: *mut Clan, id: ClanId);
}
impl Clan {
    #[inline]
    pub unsafe fn new(id: ClanId) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Clan_Clan(__bindgen_tmp.as_mut_ptr(), id);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Human_clan {
    pub _base: Clan,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Human_clan"][::std::mem::size_of::<Human_clan>() - 64usize];
    ["Alignment of Human_clan"][::std::mem::align_of::<Human_clan>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN10Human_clanC1Ev"]
    pub fn Human_clan_Human_clan(this: *mut Human_clan);
}
impl Human_clan {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Human_clan_Human_clan(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Dwarf_clan {
    pub _base: Clan,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Dwarf_clan"][::std::mem::size_of::<Dwarf_clan>() - 64usize];
    ["Alignment of Dwarf_clan"][::std::mem::align_of::<Dwarf_clan>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN10Dwarf_clanC1Ev"]
    pub fn Dwarf_clan_Dwarf_clan(this: *mut Dwarf_clan);
}
impl Dwarf_clan {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Dwarf_clan_Dwarf_clan(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf_clan {
    pub _base: Clan,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Elf_clan"][::std::mem::size_of::<Elf_clan>() - 64usize];
    ["Alignment of Elf_clan"][::std::mem::align_of::<Elf_clan>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN8Elf_clanC1Ev"]
    pub fn Elf_clan_Elf_clan(this: *mut Elf_clan);
}
impl Elf_clan {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Elf_clan_Elf_clan(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Niziolek_clan {
    pub _base: Clan,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Niziolek_clan"][::std::mem::size_of::<Niziolek_clan>() - 64usize];
    ["Alignment of Niziolek_clan"][::std::mem::align_of::<Niziolek_clan>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN13Niziolek_clanC1Ev"]
    pub fn Niziolek_clan_Niziolek_clan(this: *mut Niziolek_clan);
}
impl Niziolek_clan {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Niziolek_clan_Niziolek_clan(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_Z15get_random_clanv"]
    pub fn get_random_clan() -> *mut Clan;
}
extern "C" {
    #[link_name = "\u{1}_Z14get_clan_by_id6ClanId"]
    pub fn get_clan_by_id(id: ClanId) -> *mut Clan;
}
pub const Relations_REL_unknown: Relations = 0;
pub const Relations_REL_known: Relations = 1;
pub type Relations = ::std::os::raw::c_uint;
pub const Emotions_EMO_UNKNOWN: Emotions = 0;
pub const Emotions_EMO_ANGER: Emotions = 1;
pub const Emotions_EMO_FEAR: Emotions = 2;
pub const Emotions_EMO_DISGUST: Emotions = 3;
pub const Emotions_EMO_JOY: Emotions = 4;
pub const Emotions_EMO_SADNESS: Emotions = 5;
pub type Emotions = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlayerRelation {
    pub who: *mut Player,
    pub rel: Relations,
    pub next: *mut PlayerRelation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PlayerRelation"][::std::mem::size_of::<PlayerRelation>() - 24usize];
    ["Alignment of PlayerRelation"][::std::mem::align_of::<PlayerRelation>() - 8usize];
    ["Offset of field: PlayerRelation::who"][::std::mem::offset_of!(PlayerRelation, who) - 0usize];
    ["Offset of field: PlayerRelation::rel"][::std::mem::offset_of!(PlayerRelation, rel) - 8usize];
    ["Offset of field: PlayerRelation::next"]
        [::std::mem::offset_of!(PlayerRelation, next) - 16usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN14PlayerRelationC1EP6Player9Relations"]
    pub fn PlayerRelation_PlayerRelation(this: *mut PlayerRelation, p: *mut Player, r: Relations);
}
impl PlayerRelation {
    #[inline]
    pub unsafe fn new(p: *mut Player, r: Relations) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        PlayerRelation_PlayerRelation(__bindgen_tmp.as_mut_ptr(), p, r);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Player {
    pub _base: InventoryElement,
    pub padding: usize,
    pub name: SerializableCString,
    pub running: ::std::os::raw::c_char,
    pub sneaking: ::std::os::raw::c_char,
    pub going_right: ::std::os::raw::c_char,
    pub thirst: ::std::os::raw::c_int,
    pub hunger: ::std::os::raw::c_int,
    pub nutrition: ::std::os::raw::c_int,
    pub inventory: InvList,
    pub known_elements: ElementsList,
    pub checked_element: usize,
    pub clan: SerializablePointer<Clan>,
    pub player_skills: [Skill; 10usize],
    pub in_conversation: bool,
    pub welcomed: bool,
    pub talking_to: SerializablePointer<Player>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Player"][::std::mem::size_of::<Player>() - 264usize];
    ["Alignment of Player"][::std::mem::align_of::<Player>() - 8usize];
    ["Offset of field: Player::padding"][::std::mem::offset_of!(Player, padding) - 48usize];
    ["Offset of field: Player::name"][::std::mem::offset_of!(Player, name) - 56usize];
    ["Offset of field: Player::running"][::std::mem::offset_of!(Player, running) - 64usize];
    ["Offset of field: Player::sneaking"][::std::mem::offset_of!(Player, sneaking) - 65usize];
    ["Offset of field: Player::going_right"][::std::mem::offset_of!(Player, going_right) - 66usize];
    ["Offset of field: Player::thirst"][::std::mem::offset_of!(Player, thirst) - 68usize];
    ["Offset of field: Player::hunger"][::std::mem::offset_of!(Player, hunger) - 72usize];
    ["Offset of field: Player::nutrition"][::std::mem::offset_of!(Player, nutrition) - 76usize];
    ["Offset of field: Player::inventory"][::std::mem::offset_of!(Player, inventory) - 80usize];
    ["Offset of field: Player::known_elements"]
        [::std::mem::offset_of!(Player, known_elements) - 120usize];
    ["Offset of field: Player::checked_element"]
        [::std::mem::offset_of!(Player, checked_element) - 160usize];
    ["Offset of field: Player::clan"][::std::mem::offset_of!(Player, clan) - 168usize];
    ["Offset of field: Player::player_skills"]
        [::std::mem::offset_of!(Player, player_skills) - 192usize];
    ["Offset of field: Player::in_conversation"]
        [::std::mem::offset_of!(Player, in_conversation) - 232usize];
    ["Offset of field: Player::welcomed"][::std::mem::offset_of!(Player, welcomed) - 233usize];
    ["Offset of field: Player::talking_to"][::std::mem::offset_of!(Player, talking_to) - 240usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN6Player6pickupEP16InventoryElement"]
    pub fn Player_pickup(this: *mut Player, item: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player4dropEP16InventoryElement"]
    pub fn Player_drop(this: *mut Player, item: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player15get_item_by_uidEm"]
    pub fn Player_get_item_by_uid(this: *mut Player, id: usize) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player12conversationEPS_P8SentenceP16InventoryElement"]
    pub fn Player_conversation(
        this: *mut Player,
        who: *mut Player,
        s: *mut Sentence,
        el: *mut InventoryElement,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player17stop_conversationEv"]
    pub fn Player_stop_conversation(this: *mut Player);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player3sayEP8Sentence"]
    pub fn Player_say(this: *mut Player, s: *mut Sentence) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player10get_answerEP8Sentence"]
    pub fn Player_get_answer(this: *mut Player, s: *mut Sentence) -> *mut Sentence;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player3askEP8SentenceP16InventoryElement"]
    pub fn Player_ask(this: *mut Player, s: *mut Sentence, el: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player3askE7Npc_sayP16InventoryElement"]
    pub fn Player_ask1(this: *mut Player, s: Npc_say, el: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player18get_el_descriptionEP16InventoryElement"]
    pub fn Player_get_el_description(
        this: *mut Player,
        el: *mut InventoryElement,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player9set_knownE8Class_idi"]
    pub fn Player_set_known(this: *mut Player, cid: Class_id, el_id: ::std::os::raw::c_int)
        -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player13find_relationEPS_"]
    pub fn Player_find_relation(this: *mut Player, who: *mut Player) -> Relations;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player12set_relationEPS_9Relations"]
    pub fn Player_set_relation(this: *mut Player, who: *mut Player, rel: Relations);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player11set_checkedEm"]
    pub fn Player_set_checked(this: *mut Player, el: usize) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN6PlayerC1EmO19SerializableCString12ItemLocationiii"]
    pub fn Player_Player(
        this: *mut Player,
        uid: usize,
        name: *mut SerializableCString,
        location: ItemLocation,
        thirst: ::std::os::raw::c_int,
        hunger: ::std::os::raw::c_int,
        nutrition: ::std::os::raw::c_int,
    );
}
impl Player {
    #[inline]
    pub unsafe fn pickup(&mut self, item: *mut InventoryElement) {
        Player_pickup(self, item)
    }
    #[inline]
    pub unsafe fn drop(&mut self, item: *mut InventoryElement) {
        Player_drop(self, item)
    }
    #[inline]
    pub unsafe fn get_item_by_uid(&mut self, id: usize) -> *mut InventoryElement {
        Player_get_item_by_uid(self, id)
    }
    #[inline]
    pub unsafe fn conversation(
        &mut self,
        who: *mut Player,
        s: *mut Sentence,
        el: *mut InventoryElement,
    ) -> ::std::os::raw::c_int {
        Player_conversation(self, who, s, el)
    }
    #[inline]
    pub unsafe fn stop_conversation(&mut self) {
        Player_stop_conversation(self)
    }
    #[inline]
    pub unsafe fn say(&mut self, s: *mut Sentence) -> bool {
        Player_say(self, s)
    }
    #[inline]
    pub unsafe fn get_answer(&mut self, s: *mut Sentence) -> *mut Sentence {
        Player_get_answer(self, s)
    }
    #[inline]
    pub unsafe fn ask(&mut self, s: *mut Sentence, el: *mut InventoryElement) {
        Player_ask(self, s, el)
    }
    #[inline]
    pub unsafe fn ask1(&mut self, s: Npc_say, el: *mut InventoryElement) {
        Player_ask1(self, s, el)
    }
    #[inline]
    pub unsafe fn get_el_description(
        &mut self,
        el: *mut InventoryElement,
    ) -> *mut ::std::os::raw::c_char {
        Player_get_el_description(self, el)
    }
    #[inline]
    pub unsafe fn set_known(&mut self, cid: Class_id, el_id: ::std::os::raw::c_int) -> bool {
        Player_set_known(self, cid, el_id)
    }
    #[inline]
    pub unsafe fn find_relation(&mut self, who: *mut Player) -> Relations {
        Player_find_relation(self, who)
    }
    #[inline]
    pub unsafe fn set_relation(&mut self, who: *mut Player, rel: Relations) {
        Player_set_relation(self, who, rel)
    }
    #[inline]
    pub unsafe fn set_checked(&mut self, el: usize) -> bool {
        Player_set_checked(self, el)
    }
    #[inline]
    pub unsafe fn new(
        uid: usize,
        name: *mut SerializableCString,
        location: ItemLocation,
        thirst: ::std::os::raw::c_int,
        hunger: ::std::os::raw::c_int,
        nutrition: ::std::os::raw::c_int,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Player_Player(
            __bindgen_tmp.as_mut_ptr(),
            uid,
            name,
            location,
            thirst,
            hunger,
            nutrition,
        );
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player6get_idEv"]
    pub fn Player_get_id(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player4showEb"]
    pub fn Player_show(this: *mut ::std::os::raw::c_void, details: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN6Player11check_knownEP16InventoryElement"]
    pub fn Player_check_known(this: *mut ::std::os::raw::c_void, el: *mut InventoryElement)
        -> bool;
}
pub const biomes_BIOME_DESERT: biomes = 0;
pub const biomes_BIOME_FOREST: biomes = 1;
pub const biomes_BIOME_PLAINS: biomes = 2;
pub type biomes = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tile {
    pub tile: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tile"][::std::mem::size_of::<tile>() - 4usize];
    ["Alignment of tile"][::std::mem::align_of::<tile>() - 4usize];
    ["Offset of field: tile::tile"][::std::mem::offset_of!(tile, tile) - 0usize];
};
pub const TILE_SIZE: ::std::os::raw::c_uint = 4;
pub type chunk_table = [[tile; 17usize]; 17usize];
#[repr(C)]
#[derive(Debug)]
pub struct chunk {
    pub map_x: ::std::os::raw::c_int,
    pub map_y: ::std::os::raw::c_int,
    pub table: chunk_table,
    pub objects: InvList,
    pub beings: InvList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of chunk"][::std::mem::size_of::<chunk>() - 1248usize];
    ["Alignment of chunk"][::std::mem::align_of::<chunk>() - 8usize];
    ["Offset of field: chunk::map_x"][::std::mem::offset_of!(chunk, map_x) - 0usize];
    ["Offset of field: chunk::map_y"][::std::mem::offset_of!(chunk, map_y) - 4usize];
    ["Offset of field: chunk::table"][::std::mem::offset_of!(chunk, table) - 8usize];
    ["Offset of field: chunk::objects"][::std::mem::offset_of!(chunk, objects) - 1168usize];
    ["Offset of field: chunk::beings"][::std::mem::offset_of!(chunk, beings) - 1208usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN5chunk10add_objectEP16InventoryElementii"]
    pub fn chunk_add_object(
        this: *mut chunk,
        object: *mut InventoryElement,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5chunk10add_objectEP16InventoryElement"]
    pub fn chunk_add_object1(this: *mut chunk, object: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN5chunk13remove_objectEP16InventoryElement"]
    pub fn chunk_remove_object(this: *mut chunk, object: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_ZN5chunk10find_by_idEm"]
    pub fn chunk_find_by_id(this: *mut chunk, id: usize) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_ZN5chunk4showEv"]
    pub fn chunk_show(this: *mut chunk);
}
extern "C" {
    #[link_name = "\u{1}_ZN5chunkC1Eii"]
    pub fn chunk_chunk(
        this: *mut chunk,
        map_x: ::std::os::raw::c_int,
        map_y: ::std::os::raw::c_int,
    );
}
impl chunk {
    #[inline]
    pub unsafe fn add_object(
        &mut self,
        object: *mut InventoryElement,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    ) {
        chunk_add_object(self, object, x, y)
    }
    #[inline]
    pub unsafe fn add_object1(&mut self, object: *mut InventoryElement) {
        chunk_add_object1(self, object)
    }
    #[inline]
    pub unsafe fn remove_object(&mut self, object: *mut InventoryElement) {
        chunk_remove_object(self, object)
    }
    #[inline]
    pub unsafe fn find_by_id(&mut self, id: usize) -> *mut InventoryElement {
        chunk_find_by_id(self, id)
    }
    #[inline]
    pub unsafe fn show(&mut self) {
        chunk_show(self)
    }
    #[inline]
    pub unsafe fn new(map_x: ::std::os::raw::c_int, map_y: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        chunk_chunk(__bindgen_tmp.as_mut_ptr(), map_x, map_y);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    pub static mut world_table: [[*mut chunk; 256usize]; 256usize];
}
pub const Chunk_state_CHUNK_NOT_LOADED: Chunk_state = 0;
pub const Chunk_state_CHUNK_LOADING: Chunk_state = 1;
pub const Chunk_state_CHUNK_LOADED: Chunk_state = 2;
pub type Chunk_state = ::std::os::raw::c_uint;
extern "C" {
    pub static mut loaded_chunks: [[Chunk_state; 256usize]; 256usize];
}
extern "C" {
    #[link_name = "\u{1}_Z18remove_from_chunksP16InventoryElement"]
    pub fn remove_from_chunks(object: *mut InventoryElement);
}
extern "C" {
    #[link_name = "\u{1}_Z19add_object_to_worldP16InventoryElement12ItemLocation"]
    pub fn add_object_to_world(object: *mut InventoryElement, location: ItemLocation);
}
extern "C" {
    #[link_name = "\u{1}_Z10show_chunk12ItemLocation"]
    pub fn show_chunk(loc: ItemLocation);
}
extern "C" {
    #[link_name = "\u{1}_Z13find_in_worldP12ItemLocationm"]
    pub fn find_in_world(loc: *mut ItemLocation, uid: usize) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_Z11get_world_x12ItemLocation"]
    pub fn get_world_x(loc: ItemLocation) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_Z11get_world_y12ItemLocation"]
    pub fn get_world_y(loc: ItemLocation) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_Z11get_item_at12ItemLocation"]
    pub fn get_item_at(loc: ItemLocation) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_Z11get_tile_at12ItemLocation"]
    pub fn get_tile_at(loc: ItemLocation) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_Z13get_object_atiiii"]
    pub fn get_object_at(
        chunk_x: ::std::os::raw::c_int,
        chunk_y: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    ) -> *mut *mut Object;
}
extern "C" {
    #[link_name = "\u{1}_Z18get_object_at_pposP6Player"]
    pub fn get_object_at_ppos(player: *mut Player) -> *mut *mut Object;
}
extern "C" {
    #[link_name = "\u{1}_Z12get_plant_atiiii"]
    pub fn get_plant_at(
        chunk_x: ::std::os::raw::c_int,
        chunk_y: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    ) -> *mut *mut Plant;
}
extern "C" {
    #[link_name = "\u{1}_Z17get_plant_at_pposP6Player"]
    pub fn get_plant_at_ppos(player: *mut Player) -> *mut *mut Plant;
}
extern "C" {
    #[link_name = "\u{1}_Z18get_animal_at_pposP6Player"]
    pub fn get_animal_at_ppos(player: *mut Player) -> *mut *mut Animal;
}
extern "C" {
    #[link_name = "\u{1}_Z13get_animal_atiiii"]
    pub fn get_animal_at(
        chunk_x: ::std::os::raw::c_int,
        chunk_y: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    ) -> *mut *mut Animal;
}
extern "C" {
    #[link_name = "\u{1}_Z16get_item_at_pposP6Player"]
    pub fn get_item_at_ppos(player: *mut Player) -> *mut InventoryElement;
}
extern "C" {
    #[link_name = "\u{1}_Z11set_item_atP16InventoryElementiiii"]
    pub fn set_item_at(
        item: *mut InventoryElement,
        chunk_x: ::std::os::raw::c_int,
        chunk_y: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_Z16set_item_at_pposP16InventoryElementP6Player"]
    pub fn set_item_at_ppos(item: *mut InventoryElement, player: *mut Player);
}
extern "C" {
    #[link_name = "\u{1}_Z12check_chunksv"]
    pub fn check_chunks() -> bool;
}
#[repr(C)]
#[derive(serde :: Deserialize, Debug, Clone, Copy)]
pub struct Npc {
    pub _base: Player,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Npc"][::std::mem::size_of::<Npc>() - 264usize];
    ["Alignment of Npc"][::std::mem::align_of::<Npc>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_ZN3NpcC1E12ItemLocation"]
    pub fn Npc_Npc(this: *mut Npc, location: ItemLocation);
}
impl Npc {
    #[inline]
    pub unsafe fn new(location: ItemLocation) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        Npc_Npc(__bindgen_tmp.as_mut_ptr(), location);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_Base_close0"]
        [::std::mem::size_of::<SerializablePointer<Base>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_Base_close0"]
        [::std::mem::align_of::<SerializablePointer<Base>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_BaseElement_close0"]
        [::std::mem::size_of::<SerializablePointer<BaseElement>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_BaseElement_close0"]
        [::std::mem::align_of::<SerializablePointer<BaseElement>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_BaseAnimal_close0"]
        [::std::mem::size_of::<SerializablePointer<BaseAnimal>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_BaseAnimal_close0"]
        [::std::mem::align_of::<SerializablePointer<BaseAnimal>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_BasePlant_close0"]
        [::std::mem::size_of::<SerializablePointer<BasePlant>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_BasePlant_close0"]
        [::std::mem::align_of::<SerializablePointer<BasePlant>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_NetworkObject_close0"]
        [::std::mem::size_of::<SerializablePointer<NetworkObject>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_NetworkObject_close0"]
        [::std::mem::align_of::<SerializablePointer<NetworkObject>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_Clan_close0"]
        [::std::mem::size_of::<SerializablePointer<Clan>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_Clan_close0"]
        [::std::mem::align_of::<SerializablePointer<Clan>>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: SerializablePointer_open0_Player_close0"]
        [::std::mem::size_of::<SerializablePointer<Player>>() - 24usize];
    ["Align of template specialization: SerializablePointer_open0_Player_close0"]
        [::std::mem::align_of::<SerializablePointer<Player>>() - 8usize];
};
